# More Data Preprocessing (with Pandas)

Pandas is a very useful data analytics package within Python.

Let's start with some random data.

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f', 'h'], columns=['one', 'two', 'three'])
df

        one       two     three
a  0.816937  0.227059 -0.184292
c  0.407775 -1.964441 -2.049518
e  0.364915  0.625409 -0.585188
f -0.256073 -0.106113  0.620177
h -0.423849  2.441475 -0.817534

We know with Pandas we can mix & match data types, so let us add two more columns, named 'four' and 'five':

In [3]:
df['four'] = 'bar'
df['five'] = df['one'] > 0
df

        one       two     three four   five
a  0.816937  0.227059 -0.184292  bar   True
c  0.407775 -1.964441 -2.049518  bar   True
e  0.364915  0.625409 -0.585188  bar   True
f -0.256073 -0.106113  0.620177  bar  False
h -0.423849  2.441475 -0.817534  bar  False

Adding new rows is also simple. Below we include three extra empty rows:

In [4]:
df2 = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
df2

        one       two     three four   five
a  0.816937  0.227059 -0.184292  bar   True
b       NaN       NaN       NaN  NaN    NaN
c  0.407775 -1.964441 -2.049518  bar   True
d       NaN       NaN       NaN  NaN    NaN
e  0.364915  0.625409 -0.585188  bar   True
f -0.256073 -0.106113  0.620177  bar  False
g       NaN       NaN       NaN  NaN    NaN
h -0.423849  2.441475 -0.817534  bar  False

# Your Turn Here

Do you still remember how to index a row/column?

In [7]:
#### index row 'c' below
df2.loc['c']

one      0.407775
two      -1.96444
three    -2.04952
four          bar
five         True
Name: c, dtype: object

In [11]:
#### index column 'two' below
df2.iloc[:,1]

a    0.227059
b         NaN
c   -1.964441
d         NaN
e    0.625409
f   -0.106113
g         NaN
h    2.441475
Name: two, dtype: float64

pandas has two functions isnull() and notnull() that return boolean objects when called.

In [12]:
pd.isnull(df2['one'])

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [13]:
pd.notnull(df2['one'])

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool

Missing values propagate naturally through arithmetic operations between pandas objects.

In [15]:
a = df[['one','two']]
a['one']['a':'e'] = float('nan')
a

        one       two
a       NaN  0.227059
c       NaN -1.964441
e       NaN  0.625409
f -0.256073 -0.106113
h -0.423849  2.441475

In [16]:
b = df[['one','two','three']]
b

        one       two     three
a  0.816937  0.227059 -0.184292
c  0.407775 -1.964441 -2.049518
e  0.364915  0.625409 -0.585188
f -0.256073 -0.106113  0.620177
h -0.423849  2.441475 -0.817534

In [17]:
a + b

        one  three       two
a       NaN    NaN  0.454119
c       NaN    NaN -3.928883
e       NaN    NaN  1.250817
f -0.512145    NaN -0.212226
h -0.847697    NaN  4.882950

# How to deal with Missing Values

## Deleting Missing Values

The simplest method is always dropping all missing values - but it is highly **discouraged!!!**

In [18]:
a['one'].dropna()

f   -0.256073
h   -0.423849
Name: one, dtype: float64

By default, dropna() will drop any row containing **NaN** values, but you can change that by using the *axis=* and *thresh=* arguments.

**NOTE**: Dropping rows or columns have different uses.

In [20]:
#### This statement drop any column with NaN values
a.dropna(axis=1)

        two
a  0.227059
c -1.964441
e  0.625409
f -0.106113
h  2.441475

In [21]:
#### thresh determines how many non-NaN values a column/row should have without being dropped
c = a + b
c.dropna(axis=1, thresh=2)

        one       two
a       NaN  0.454119
c       NaN -3.928883
e       NaN  1.250817
f -0.512145 -0.212226
h -0.847697  4.882950

You can also use the *how=* argument to determine how do you want to remove the NaN values.

In [22]:
#### By default, dropna() drops column/row with any NaN values
#### how = 'all' changes that to dropping column/row with all NaN values
c.dropna(axis=1, how='all')

        one       two
a       NaN  0.454119
c       NaN -3.928883
e       NaN  1.250817
f -0.512145 -0.212226
h -0.847697  4.882950

You can refer to the [pandas.dropna() docs](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.dropna.html) for more information.

## Imputing Missing Values

Imputing means filling missing values - you can do that when the missing and non-missing values are in some type of relationship.

In [23]:
my_series = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
my_series

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [24]:
#### you can fill missing values with a specific value (0)
my_series.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

Alternatively, we can specify a forward-fill to propagate the previous value forward:

In [25]:
# forward-fill
my_series.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

Or we can specify a back-fill to propagate the next values backward:

In [26]:
my_series.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

## Your Turn Here
Aforementioned method can be applied to dataframes.

In [33]:
#### Let us generate a random dataframe
rand_df = pd.DataFrame(np.random.randn(5, 3), 
                  index=['a', 'b', 'c', 'd', 'e'],
                  columns=['one', 'two', 'three'])
rand_df = rand_df.mask(np.random.random(rand_df.shape) < .3)
rand_df

        one       two     three
a  0.311206 -0.089551 -1.385273
b  0.198970  0.185650 -0.166543
c       NaN  0.938443  0.306616
d  0.702465  1.525705  1.488039
e  0.747439       NaN  1.630753

Your tasks are as follows:

- fill missing values in column **one** with value 1;
- fill missing values in column **two** with forward-filling;
- fill missing values in column **three** with backward-filling.

In [37]:
#fill missing values in column one with value 1;
rand_df.iloc[:,0].fillna(1)

a    0.311206
b    0.198970
c    1.000000
d    0.702465
e    0.747439
Name: one, dtype: float64

In [39]:
#fill missing values in column two with forward-filling;
rand_df.iloc[:,1].fillna(method='ffill')

a   -0.089551
b    0.185650
c    0.938443
d    1.525705
e    1.525705
Name: two, dtype: float64

In [41]:
#fill missing values in column three with backward-filling.
rand_df.iloc[:,2].fillna(method='bfill')

a   -1.385273
b   -0.166543
c    0.306616
d    1.488039
e    1.630753
Name: three, dtype: float64

A useful approach for imputing your missing data is to use mean/mode to replace missing data - the reason behind this logic is that if we are going to *guess* the values of the missing data, the highest chance would be guessing it to be the mean/mode if the data follows **normal** distribution.

In [42]:
#### let us generate another DF
my_df = pd.DataFrame(np.random.randn(5, 3), 
                  index=['a', 'b', 'c', 'd', 'e'],
                  columns=['A', 'B', 'C'])
my_df = my_df.mask(np.random.random(my_df.shape) < .3)
my_df

          A         B         C
a       NaN  1.297423  0.789238
b -0.744132  0.429455 -0.007862
c  0.440460       NaN -1.121494
d       NaN -1.061475       NaN
e  1.107703 -0.126650       NaN

In [43]:
#### Let us check if there is any missing value in the df
my_df.isnull().values.any()

True

In [44]:
#### Then we are getting the mean of the DF
#### Note that since we only 
my_df.mean()

A    0.268010
B    0.134688
C   -0.113373
dtype: float64

In [45]:
df_filled = my_df.fillna(my_df.mean())
df_filled

          A         B         C
a  0.268010  1.297423  0.789238
b -0.744132  0.429455 -0.007862
c  0.440460  0.134688 -1.121494
d  0.268010 -1.061475 -0.113373
e  1.107703 -0.126650 -0.113373

In [46]:
#### Now let us check again if there is any missing values
df_filled.isnull().values.any()

False

More info regarding how to handle missing data can be found [here](https://machinelearningmastery.com/handle-missing-data-python/).

# Other Tasks in Data Preprocessing

- Handling categorical data (coding)
- Handling imbalanced data
- feature engineering

These topics will be covered in later part of this class.

Completed review